Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/edc/PIC32CZ4010CA90100S1.PIC
      <edc:SFRDef ltx:memberofperipheral="TAMPER" edc:cname="LEVELC" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00010001000100010001000100010001" edc:mclr="00010001000100010001000100010001" edc:_addr="0x59000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TAMPER">
            <edc:SFRFieldDef edc:cname="LEVEL16" edc:nzwidth="0x4" edc:desc="Level 16">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL17" edc:nzwidth="0x4" edc:desc="Level 17">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL18" edc:nzwidth="0x4" edc:desc="Level 18">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL19" edc:nzwidth="0x4" edc:desc="Level 19">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL20" edc:nzwidth="0x4" edc:desc="Level 20">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL21" edc:nzwidth="0x4" edc:desc="Level 21">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL22" edc:nzwidth="0x4" edc:desc="Level 22">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL23" edc:nzwidth="0x4" edc:desc="Level 23">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TAMPER" edc:cname="LEVELD" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:por="00010001000100010001000100010001" edc:mclr="00010001000100010001000100010001" edc:_addr="0x5900040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TAMPER">
            <edc:SFRFieldDef edc:cname="LEVEL24" edc:nzwidth="0x4" edc:desc="Level 24">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x06"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL25" edc:nzwidth="0x4" edc:desc="Level 25">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL26" edc:nzwidth="0x4" edc:desc="Level 26">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL27" edc:nzwidth="0x4" edc:desc="Level 27">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL28" edc:nzwidth="0x4" edc:desc="Level 28">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL29" edc:nzwidth="0x4" edc:desc="Level 29">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL30" edc:nzwidth="0x4" edc:desc="Level 30">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL31" edc:nzwidth="0x4" edc:desc="Level 31">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Action" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="HOSTIRQ" edc:desc="Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LEHIRQ" edc:desc="Log Event and Host Interrupt" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SAFEMODE" edc:desc="Enter Safe Mode" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSTKEY" edc:desc="Erase Tamper Key" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ERSFKEY" edc:desc="Erase Flash Key" edc:when="(field &amp; 0xF) == 0x00"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TAMPER" edc:cname="SETLEVEL" edc:nzwidth="0x20" edc:access="wwwwwwwwwwwwwwww---wwwww-----www" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF1F07" edc:_addr="0x59000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TAMPER">
            <edc:SFRFieldDef edc:cname="TamperLevel" edc:nzwidth="0x3" edc:desc="Tamper Level"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="TamperID" edc:nzwidth="0x5" edc:desc="Tamper ID"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ProtectionKey" edc:nzwidth="0x10" edc:desc="Protection Key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TAMPER" edc:cname="FILTERCFG" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnn-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF1F07" edc:_addr="0x59000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TAMPER">
            <edc:SFRFieldDef edc:cname="Threshold" edc:nzwidth="0x3" edc:desc="Filter Threshold"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="Period" edc:nzwidth="0x5" edc:desc="Filter Period"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ProtectionKey" edc:nzwidth="0x10" edc:desc="Filter Protection Key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TAMPER" edc:cname="SOFTTAMP" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnn-------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF1F01" edc:_addr="0x59000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TAMPER">
            <edc:SFRFieldDef edc:cname="TamperActive" edc:nzwidth="0x1" edc:desc="Tamper Active"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TamperID" edc:nzwidth="0x5" edc:desc="Tamper ID"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="ProtectionKey" edc:nzwidth="0x10" edc:desc="Protection Key"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
